Jmeter-blog-html-report/statistics.json
{
  "事务控制器" : {
    "transaction" : "事务控制器",
    "sampleCount" : 7579,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.33645599683341,
    "medianResTime" : 53.0,
    "minResTime" : 44.0,
    "maxResTime" : 183.0,
    "pct1ResTime" : 70.0,
    "pct2ResTime" : 87.0,
    "pct3ResTime" : 134.0,
    "throughput" : 124.56241268797764,
    "receivedKBytesPerSec" : 1429.061742439806,
    "sentKBytesPerSec" : 72.25536904737447
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 22764,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 38.323800738007435,
    "medianResTime" : 29.0,
    "minResTime" : 22.0,
    "maxResTime" : 15074.0,
    "pct1ResTime" : 54.0,
    "pct2ResTime" : 62.0,
    "pct3ResTime" : 93.9900000000016,
    "throughput" : 366.9718854784627,
    "receivedKBytesPerSec" : 1448.1465494875629,
    "sentKBytesPerSec" : 117.93322461088633
  },
  "列表页接口HTTP请求" : {
    "transaction" : "列表页接口HTTP请求",
    "sampleCount" : 7588,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.710859251449616,
    "medianResTime" : 26.0,
    "minResTime" : 22.0,
    "maxResTime" : 136.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 44.0,
    "pct3ResTime" : 72.0,
    "throughput" : 124.65296601120366,
    "receivedKBytesPerSec" : 998.5627736229527,
    "sentKBytesPerSec" : 35.24100316950865
  },
  "登录页接口HTTP请求" : {
    "transaction" : "登录页接口HTTP请求",
    "sampleCount" : 7597,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 57.6060286955378,
    "medianResTime" : 50.0,
    "minResTime" : 44.0,
    "maxResTime" : 15074.0,
    "pct1ResTime" : 64.0,
    "pct2ResTime" : 76.0,
    "pct3ResTime" : 111.0,
    "throughput" : 122.46904823316999,
    "receivedKBytesPerSec" : 45.26806099069835,
    "sentKBytesPerSec" : 47.0194252059421
  },
  "列表详情页HTTP请求" : {
    "transaction" : "列表详情页HTTP请求",
    "sampleCount" : 7579,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 28.620134582398812,
    "medianResTime" : 26.0,
    "minResTime" : 22.0,
    "maxResTime" : 140.0,
    "pct1ResTime" : 35.0,
    "pct2ResTime" : 44.0,
    "pct3ResTime" : 74.0,
    "throughput" : 124.72435243392687,
    "receivedKBytesPerSec" : 431.78498962721756,
    "sentKBytesPerSec" : 37.088161451305005
  }
}